#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Книга Девида Бизли "Python подробный справочник 4ое издание"
страница 96
Операторы и выражения
"""
__author__ = "shmakovpn <shmakovpn@yandex.ru>"
__date__ = "2019-12-11"

x = 25
y = 7

# операции над числами
print(f"x+y={x+y}")  # сложение
print(f"x-y={x-y}")  # вычитание
print(f"x*y={x*y}")  # умножение
print(f"x/y={x/y}")  # деление
print(f"x//y={x//y}")  # деление с усечением
print(f"x**y={x**y}")  # возведение в степень
print(f"x%y={x%y}")  # деление по модулю (остаток от деления)
print(f"-x={-x}")  # унарный минус
print(f"-(-7)={-(-7)}")
print(f"+x={+x}")
print(f"+(-7)={+(-7)}")

# операторы сдвига и битовые операторы, которые могут применяться к целым цислам
print(f"bin(100)={bin(100)}")
print(f"bin(100>>1)={bin(100>>1)}")
print(f"bin(100>>2)={bin(100>>2)}")
print(f"bin(100<<1)={bin(100<<1)}")
print(f"bin(100<<2)={bin(100<<2)}")
print(f"bin(100)={bin(100)}")
print(f"bin(75)={bin(75)}")
print(f"bin(100&75)={bin(100 & 75)}")
print(f"bin(100|75)={bin(100 | 75)}")
print(f"bin(100^75)={bin(100 ^ 75)}")
print(f"bin(~100)={bin(~100)}")
print(f"bin(-(100+1))={bin(-(100+1))}")
print(f"bin(100<<100)={bin(100 << 100)}")
print(f"100<<100={100 << 100}")

# встроенные функции
print(f"abs(-67)={abs(-67)}")
print(f"divmod(67,7)={divmod(67, 7)}")  # Возвращает кортеж (x // y, x % y)
print(f"pow(67,3,7)={pow(67, 3, 7)}")  # Возвращает результат выражения (x ** y) % modulo
print(f"round(2.345, 2)={round(2.345, 2)}")

# операторы сравнения
print(f"2<3={2 < 3}; 2>3={2 > 3}; 2==2={2 == 2}; 2<=3={2 <= 3}; 2>=3={2 >= 3};")

# группировка операторов сравнения
# w < x < y < z
# w < x and x < y and y < z

a = 1+1j
b = 2+2j

try:
    print(f"a<b={a < b}")
except TypeError as e:
    print(f"комплексные числа нельзя сравнивать")


# форматирование строк
# d, i - целое или длинное целое число
print(f"{1823874295:d}")

